bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_struct.h
// Copyright 2022-2023 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once

#ifdef __cplusplus
extern "C" {
#endif


typedef volatile union {
	struct {
		uint32_t deviceid                         : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_device_id_t;


typedef volatile union {
	struct {
		uint32_t versionid                        : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_version_id_t;


typedef volatile union {
	struct {
		uint32_t boot_mode                        :  1; /**<bit[0 : 0] */
		uint32_t clkg_bps                         :  1; /**<bit[1 : 1] */
		uint32_t reserved_bit_2_3                 :  2; /**<bit[2 : 3] */
		uint32_t rf_switch_manual_en              :  1; /**<bit[4 : 4] */
		uint32_t rf_source                        :  2; /**<bit[5 : 6] */
		uint32_t reserved_7_7                     :  1; /**<bit[7 : 7] */
		uint32_t reserved_bit_8_8                 :  1; /**<bit[8 : 8] */
		uint32_t flash_sel                        :  1; /**<bit[9 : 9] */
		uint32_t fem_bps_txen                     :  1; /**<bit[10 : 10] */
		uint32_t gpio_flash_sys_enable            :  1; /**<bit[11 : 11] */
		uint32_t boot_mode_norst                  :  1; /**<bit[12 : 12] */
		uint32_t reserved_bit_13_31               : 19; /**<bit[13 : 31] */
	};
	uint32_t v;
} sys_cpu_storage_connect_op_select_t;


typedef volatile union {
	struct {
		uint32_t core0_halted                     :  1; /**<bit[0 : 0] */
		uint32_t core1_halted                     :  1; /**<bit[1 : 1] */
		uint32_t reserved_bit_2_3                 :  2; /**<bit[2 : 3] */
		uint32_t cpu0_sw_reset                    :  1; /**<bit[4 : 4] */
		uint32_t cpu1_sw_reset                    :  1; /**<bit[5 : 5] */
		uint32_t reserved_bit_6_7                 :  2; /**<bit[6 : 7] */
		uint32_t cpu0_pwr_dw_state                :  1; /**<bit[8 : 8] */
		uint32_t cpu1_pwr_dw_state                :  1; /**<bit[9 : 9] */
		uint32_t reserved_bit_10_11               :  2; /**<bit[10 : 11] */
		uint32_t cpu0_exist                       :  1; /**<bit[12 : 12] */
		uint32_t cpu1_exist                       :  1; /**<bit[13 : 13] */
		uint32_t cpu2_exist                       :  1; /**<bit[14 : 14] */
		uint32_t cpu3_exist                       :  1; /**<bit[15 : 15] */
		uint32_t reserved_bit_16_31               : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} sys_cpu_current_run_status_t;


typedef volatile union {
	struct {
		uint32_t cpu0_sw_rst                      :  1; /**<bit[0 : 0] */
		uint32_t cpu0_pwr_dw                      :  1; /**<bit[1 : 1] */
		uint32_t cpu_int_mask                     :  1; /**<bit[2 : 2] */
		uint32_t cpu0_halt                        :  1; /**<bit[3 : 3] */
		uint32_t reserved_bit_4_4                 :  1; /**<bit[4 : 4] */
		uint32_t cpu0_rxevt_sel                   :  2; /**<bit[5 : 6] */
		uint32_t reserved_7_7                     :  1; /**<bit[7 : 7] */
		uint32_t cpu0_offset                      : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_halt_clk_op_t;


typedef volatile union {
	struct {
		uint32_t cpu1_sw_rst                      :  1; /**<bit[0 : 0] */
		uint32_t cpu1_pwr_dw                      :  1; /**<bit[1 : 1] */
		uint32_t reserved_2_2                     :  1; /**<bit[2 : 2] */
		uint32_t cpu1_halt                        :  1; /**<bit[3 : 3] */
		uint32_t reserved_bit_4_4                 :  1; /**<bit[4 : 4] */
		uint32_t cpu1_rxevt_sel                   :  2; /**<bit[5 : 6] */
		uint32_t reserved_7_7                     :  1; /**<bit[7 : 7] */
		uint32_t cpu1_offset                      : 24; /**<bit[8 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_halt_clk_op_t;


typedef volatile union {
	struct {
		uint32_t cksel_core                       :  2; /**<bit[0 : 1] */
		uint32_t ckdiv_core                       :  4; /**<bit[2 : 5] */
		uint32_t cksel_flash                      :  2; /**<bit[6 : 7] */
		uint32_t ckdiv_flash                      :  3; /**<bit[8 : 10] */
		uint32_t cksel_auxs                       :  2; /**<bit[11 : 12] */
		uint32_t ckdiv_auxs                       :  6; /**<bit[13 : 18] */
		uint32_t ckdiv_26mo                       :  3; /**<bit[19 : 21] */
		uint32_t reserved_22_23                   :  2; /**<bit[22 : 23] */
		uint32_t phase_cfg_960m                   :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_cpu_clk_div_mode1_t;


typedef volatile union {
	struct {
		uint32_t cksel_i2c0                       :  1; /**<bit[0 : 0] */
		uint32_t cksel_i2c3                       :  1; /**<bit[1 : 1] */
		uint32_t cksel_uart0                      :  1; /**<bit[2 : 2] */
		uint32_t cksel_uart1                      :  1; /**<bit[3 : 3] */
		uint32_t cksel_uart2                      :  1; /**<bit[4 : 4] */
		uint32_t cksel_uart3                      :  1; /**<bit[5 : 5] */
		uint32_t cksel_uart4                      :  1; /**<bit[6 : 6] */
		uint32_t cksel_spi0                       :  1; /**<bit[7 : 7] */
		uint32_t cksel_spi1                       :  1; /**<bit[8 : 8] */
		uint32_t cksel_spi2                       :  1; /**<bit[9 : 9] */
		uint32_t cksel_spi3                       :  1; /**<bit[10 : 10] */
		uint32_t cksel_i2s0                       :  1; /**<bit[11 : 11] */
		uint32_t ckdiv_i2s0                       :  2; /**<bit[12 : 13] */
		uint32_t cksel_i2s1                       :  1; /**<bit[14 : 14] */
		uint32_t ckdiv_i2s1                       :  2; /**<bit[15 : 16] */
		uint32_t cksel_i2s2                       :  1; /**<bit[17 : 17] */
		uint32_t ckdiv_i2s2                       :  2; /**<bit[18 : 19] */
		uint32_t cksel_i2s3                       :  1; /**<bit[20 : 20] */
		uint32_t ckdiv_i2s3                       :  2; /**<bit[21 : 22] */
		uint32_t cksel_i2s4                       :  1; /**<bit[23 : 23] */
		uint32_t ckdiv_i2s4                       :  2; /**<bit[24 : 25] */
		uint32_t cksel_sadc                       :  1; /**<bit[26 : 26] */
		uint32_t cksel_i3c                        :  1; /**<bit[27 : 27] */
		uint32_t cksel_tim0                       :  1; /**<bit[28 : 28] */
		uint32_t cksel_tim1                       :  1; /**<bit[29 : 29] */
		uint32_t cksel_tim2                       :  1; /**<bit[30 : 30] */
		uint32_t cksel_tim3                       :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_clk_div_mode2_t;


typedef volatile union {
	struct {
		uint32_t cksel_pwm0                       :  1; /**<bit[0 : 0] */
		uint32_t cksel_can0                       :  1; /**<bit[1 : 1] */
		uint32_t cksel_can1                       :  1; /**<bit[2 : 2] */
		uint32_t cksel_scr0                       :  1; /**<bit[3 : 3] */
		uint32_t cksel_audio                      :  1; /**<bit[4 : 4] */
		uint32_t ckdiv_audio                      :  3; /**<bit[5 : 7] */
		uint32_t cksel_audif0                     :  1; /**<bit[8 : 8] */
		uint32_t ckdiv_audif0                     :  3; /**<bit[9 : 11] */
		uint32_t cksel_audif1                     :  1; /**<bit[12 : 12] */
		uint32_t ckdiv_audif1                     :  3; /**<bit[13 : 15] */
		uint32_t ckdiv_i2so                       :  3; /**<bit[16 : 18] */
		uint32_t cksel_auxs_enet                  :  1; /**<bit[19 : 19] */
		uint32_t ckdiv_auxs_enet                  :  4; /**<bit[20 : 23] */
		uint32_t cksel_trace                      :  1; /**<bit[24 : 24] */
		uint32_t ckdiv_trace                      :  3; /**<bit[25 : 27] */
		uint32_t reserved_28_31                   :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_cpu_clk_div_mode3_t;


typedef volatile union {
	struct {
		uint32_t anaspi_freq                      :  6; /**<bit[0 : 5] */
		uint32_t reserved_bit_6_31                : 26; /**<bit[6 : 31] */
	};
	uint32_t v;
} sys_cpu_anaspi_freq_t;


typedef volatile union {
	struct {
		uint32_t tim0_cken                        :  1; /**<bit[0 : 0] */
		uint32_t tim1_cken                        :  1; /**<bit[1 : 1] */
		uint32_t tim2_cken                        :  1; /**<bit[2 : 2] */
		uint32_t tim3_cken                        :  1; /**<bit[3 : 3] */
		uint32_t uart0_cken                       :  1; /**<bit[4 : 4] */
		uint32_t uart1_cken                       :  1; /**<bit[5 : 5] */
		uint32_t uart2_cken                       :  1; /**<bit[6 : 6] */
		uint32_t uart3_cken                       :  1; /**<bit[7 : 7] */
		uint32_t uart4_cken                       :  1; /**<bit[8 : 8] */
		uint32_t spi0_cken                        :  1; /**<bit[9 : 9] */
		uint32_t spi1_cken                        :  1; /**<bit[10 : 10] */
		uint32_t spi2_cken                        :  1; /**<bit[11 : 11] */
		uint32_t spi3_cken                        :  1; /**<bit[12 : 12] */
		uint32_t sadc_cken                        :  1; /**<bit[13 : 13] */
		uint32_t pwm0_cken                        :  1; /**<bit[14 : 14] */
		uint32_t otp_cken                         :  1; /**<bit[15 : 15] */
		uint32_t i3c_cken                         :  1; /**<bit[16 : 16] */
		uint32_t i2s0_cken                        :  1; /**<bit[17 : 17] */
		uint32_t i2s1_cken                        :  1; /**<bit[18 : 18] */
		uint32_t i2s2_cken                        :  1; /**<bit[19 : 19] */
		uint32_t i2s3_cken                        :  1; /**<bit[20 : 20] */
		uint32_t i2s4_cken                        :  1; /**<bit[21 : 21] */
		uint32_t i2c0_cken                        :  1; /**<bit[22 : 22] */
		uint32_t i2c3_cken                        :  1; /**<bit[23 : 23] */
		uint32_t irda0_cken                       :  1; /**<bit[24 : 24] */
		uint32_t irda1_cken                       :  1; /**<bit[25 : 25] */
		uint32_t irda2_cken                       :  1; /**<bit[26 : 26] */
		uint32_t irda3_cken                       :  1; /**<bit[27 : 27] */
		uint32_t can0_cken                        :  1; /**<bit[28 : 28] */
		uint32_t can1_cken                        :  1; /**<bit[29 : 29] */
		uint32_t lin0_cken                        :  1; /**<bit[30 : 30] */
		uint32_t scr0_cken                        :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_device_clk_enable_t;


typedef volatile union {
	struct {
		uint32_t audio_cken                       :  1; /**<bit[0 : 0] */
		uint32_t audif0_cken                      :  1; /**<bit[1 : 1] */
		uint32_t audif1_cken                      :  1; /**<bit[2 : 2] */
		uint32_t i2so_cken                        :  1; /**<bit[3 : 3] */
		uint32_t cec_cken                         :  1; /**<bit[4 : 4] */
		uint32_t xdac0_cken                       :  1; /**<bit[5 : 5] */
		uint32_t xdac1_cken                       :  1; /**<bit[6 : 6] */
		uint32_t auxs_cken                        :  1; /**<bit[7 : 7] */
		uint32_t auxs_enet_cken                   :  1; /**<bit[8 : 8] */
		uint32_t sig_26ms_cken                    :  1; /**<bit[9 : 9] */
		uint32_t sig_32ks_cken                    :  1; /**<bit[10 : 10] */
		uint32_t sig_26mo_cken                    :  1; /**<bit[11 : 11] */
		uint32_t sig_240m_cken                    :  1; /**<bit[12 : 12] */
		uint32_t sig_320m_cken                    :  1; /**<bit[13 : 13] */
		uint32_t sig_480m_cken                    :  1; /**<bit[14 : 14] */
		uint32_t sig_160m_cken                    :  1; /**<bit[15 : 15] */
		uint32_t sig_120m_cken                    :  1; /**<bit[16 : 16] */
		uint32_t trace_cken                       :  1; /**<bit[17 : 17] */
		uint32_t reserved_18_21                   :  4; /**<bit[18 : 21] */
		uint32_t wlss_cken                        :  1; /**<bit[22 : 22] */
		uint32_t btdm_cken                        :  1; /**<bit[23 : 23] */
		uint32_t xver_cken                        :  1; /**<bit[24 : 24] */
		uint32_t mac_cken                         :  1; /**<bit[25 : 25] */
		uint32_t phy_cken                         :  1; /**<bit[26 : 26] */
		uint32_t thread_cken                      :  1; /**<bit[27 : 27] */
		uint32_t bk24_cken                        :  1; /**<bit[28 : 28] */
		uint32_t rf_cken                          :  1; /**<bit[29 : 29] */
		uint32_t ofdm_cken                        :  1; /**<bit[30 : 30] */
		uint32_t reserved_31_31                   :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0xd_t;


typedef volatile union {
	struct {
		uint32_t reserved_0_0                     :  1; /**<bit[0 : 0] */
		uint32_t reserved_1_1                     :  1; /**<bit[1 : 1] */
		uint32_t reserved_2_2                     :  1; /**<bit[2 : 2] */
		uint32_t macp_mem_ret                     :  1; /**<bit[3 : 3] */
		uint32_t phyp_mem_ret                     :  1; /**<bit[4 : 4] */
		uint32_t thread_mem_ret                   :  1; /**<bit[5 : 5] */
		uint32_t encp_mem_ret                     :  1; /**<bit[6 : 6] */
		uint32_t can0_mem_ret                     :  1; /**<bit[7 : 7] */
		uint32_t can1_mem_ret                     :  1; /**<bit[8 : 8] */
		uint32_t irda0_mem_ret                    :  1; /**<bit[9 : 9] */
		uint32_t irda1_mem_ret                    :  1; /**<bit[10 : 10] */
		uint32_t dma0_mem_ret                     :  1; /**<bit[11 : 11] */
		uint32_t spi1_mem_ret                     :  1; /**<bit[12 : 12] */
		uint32_t spi2_mem_ret                     :  1; /**<bit[13 : 13] */
		uint32_t uart1_mem_ret                    :  1; /**<bit[14 : 14] */
		uint32_t uart2_mem_ret                    :  1; /**<bit[15 : 15] */
		uint32_t uart3_mem_ret                    :  1; /**<bit[16 : 16] */
		uint32_t uart0_mem_ret                    :  1; /**<bit[17 : 17] */
		uint32_t spi0_mem_ret                     :  1; /**<bit[18 : 18] */
		uint32_t flsh_mem_ret                     :  1; /**<bit[19 : 19] */
		uint32_t audp_mem_ret                     :  1; /**<bit[20 : 20] */
		uint32_t i3c_mem_ret                      :  1; /**<bit[21 : 21] */
		uint32_t xvr_mem_ret                      :  1; /**<bit[22 : 22] */
		uint32_t reserved_23_23                   :  1; /**<bit[23 : 23] */
		uint32_t bk24_mem_ret                     :  1; /**<bit[24 : 24] */
		uint32_t irda2_mem_ret                    :  1; /**<bit[25 : 25] */
		uint32_t irda3_mem_ret                    :  1; /**<bit[26 : 26] */
		uint32_t spi3_mem_ret                     :  1; /**<bit[27 : 27] */
		uint32_t uart4_mem_ret                    :  1; /**<bit[28 : 28] */
		uint32_t cpu0_mem_ret                     :  1; /**<bit[29 : 29] */
		uint32_t cpu1_mem_ret                     :  1; /**<bit[30 : 30] */
		uint32_t coresight_mem_ret                :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0xf_t;


typedef volatile union {
	struct {
		uint32_t pwd_cpu1                         :  1; /**<bit[0 : 0] */
		uint32_t pwd_vehp                         :  1; /**<bit[1 : 1] */
		uint32_t pwd_wrls                         :  1; /**<bit[2 : 2] */
		uint32_t rom_pgen                         :  1; /**<bit[3 : 3] */
		uint32_t cpu1_isolate_state               :  1; /**<bit[4 : 4] */
		uint32_t vehp_isolate_state               :  1; /**<bit[5 : 5] */
		uint32_t wrls_isolate_state               :  1; /**<bit[6 : 6] */
		uint32_t reserved_7_30                    : 24; /**<bit[7 : 30] */
		uint32_t busmatrix_busy                   :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0x10_t;


typedef volatile union {
	struct {
		uint32_t sleep_en_global                  :  1; /**<bit[0 : 0] */
		uint32_t sleep_en_need_flash_idle         :  1; /**<bit[1 : 1] */
		uint32_t sleep_bus_idle_bypass            :  1; /**<bit[2 : 2] */
		uint32_t sleep_en_need_cpu0_wfi           :  1; /**<bit[3 : 3] */
		uint32_t sleep_en_need_cpu1_wfi           :  1; /**<bit[4 : 4] */
		uint32_t reserved_bit_5_11                :  7; /**<bit[5 : 11] */
		uint32_t reserved_12_15                   :  4; /**<bit[12 : 15] */
		uint32_t cpu0_ticktimer_32k_enable        :  1; /**<bit[16 : 16] */
		uint32_t cpu1_ticktimer_32k_enable        :  1; /**<bit[17 : 17] */
		uint32_t reserved_bit_18_19               :  2; /**<bit[18 : 19] */
		uint32_t reserved_20_24                   :  5; /**<bit[20 : 24] */
		uint32_t bts_soft_wakeup_req              :  1; /**<bit[25 : 25] */
		uint32_t rom_rd_disable                   :  1; /**<bit[26 : 26] */
		uint32_t otp_rd_disable                   :  1; /**<bit[27 : 27] */
		uint32_t share_mem_clkgating_disable      :  1; /**<bit[28 : 28] */
		uint32_t reserved_29_31                   :  3; /**<bit[29 : 31] */
	};
	uint32_t v;
} sys_cpu_power_sleep_wakeup_t;


typedef volatile union {
	struct {
		uint32_t cpu0_dma0_nsec_int_en            :  1; /**<bit[0 : 0] */
		uint32_t cpu0_encp_sec_intr_int_en        :  1; /**<bit[1 : 1] */
		uint32_t cpu0_encp_nsec_intr_int_en       :  1; /**<bit[2 : 2] */
		uint32_t cpu0_timer_int_en                :  1; /**<bit[3 : 3] */
		uint32_t cpu0_uart_int_en                 :  1; /**<bit[4 : 4] */
		uint32_t cpu0_pwm0_int_en                 :  1; /**<bit[5 : 5] */
		uint32_t cpu0_i2c0_int_en                 :  1; /**<bit[6 : 6] */
		uint32_t cpu0_spi0_int_en                 :  1; /**<bit[7 : 7] */
		uint32_t cpu0_sadc_int_en                 :  1; /**<bit[8 : 8] */
		uint32_t cpu0_irda_int_en                 :  1; /**<bit[9 : 9] */
		uint32_t cpu0_l2_sec_int_en               :  1; /**<bit[10 : 10] */
		uint32_t cpu0_dma0_sec_int_en             :  1; /**<bit[11 : 11] */
		uint32_t cpu0_la_int_en                   :  1; /**<bit[12 : 12] */
		uint32_t cpu0_acomp0_int_en               :  1; /**<bit[13 : 13] */
		uint32_t cpu0_acomp1_int_en               :  1; /**<bit[14 : 14] */
		uint32_t cpu0_uart1_int_en                :  1; /**<bit[15 : 15] */
		uint32_t cpu0_cpu0_fpu_int_en             :  1; /**<bit[16 : 16] */
		uint32_t cpu0_cpu1_fpu_int_en             :  1; /**<bit[17 : 17] */
		uint32_t cpu0_can_int_en                  :  1; /**<bit[18 : 18] */
		uint32_t cpu0_l2_nsec_int_en              :  1; /**<bit[19 : 19] */
		uint32_t cpu0_vid_disp0_int_en            :  1; /**<bit[20 : 20] */
		uint32_t cpu0_ckmn_int_en                 :  1; /**<bit[21 : 21] */
		uint32_t cpu0_vid_disp1_int_en            :  1; /**<bit[22 : 22] */
		uint32_t cpu0_aud_int_en                  :  1; /**<bit[23 : 23] */
		uint32_t cpu0_i2s0_int_en                 :  1; /**<bit[24 : 24] */
		uint32_t cpu0_i2s1_int_en                 :  1; /**<bit[25 : 25] */
		uint32_t cpu0_vid_disp2_int_en            :  1; /**<bit[26 : 26] */
		uint32_t cpu0_ipchecksum_int_en           :  1; /**<bit[27 : 27] */
		uint32_t cpu0_thread_int_en               :  1; /**<bit[28 : 28] */
		uint32_t cpu0_phy_mbp_int_en              :  1; /**<bit[29 : 29] */
		uint32_t cpu0_phy_riu_int_en              :  1; /**<bit[30 : 30] */
		uint32_t cpu0_mac_int_tx_rx_timer_n_int_en :  1; /**<bit[31 : 31] */
	};
	uint32_t cpu0_inten                       : 32; /**<bit[0 : 31] */
	uint32_t v;
} sys_cpu0_int_0_31_en_t;


typedef volatile union {
	struct {
		uint32_t cpu0_mac_int_tx_rx_misc_n_int_en :  1; /**<bit[0 : 0] */
		uint32_t cpu0_mac_int_rx_trigger_n_int_en :  1; /**<bit[1 : 1] */
		uint32_t cpu0_mac_int_tx_trigger_n_int_en :  1; /**<bit[2 : 2] */
		uint32_t cpu0_mac_int_port_trigger_n_int_en :  1; /**<bit[3 : 3] */
		uint32_t cpu0_mac_int_gen_n_int_en        :  1; /**<bit[4 : 4] */
		uint32_t cpu0_gpio_ns_int_en              :  1; /**<bit[5 : 5] */
		uint32_t cpu0_int_mac_wakeup_int_en       :  1; /**<bit[6 : 6] */
		uint32_t cpu0_dm_irq_int_en               :  1; /**<bit[7 : 7] */
		uint32_t cpu0_ble_irq_int_en              :  1; /**<bit[8 : 8] */
		uint32_t cpu0_bt_irq_int_en               :  1; /**<bit[9 : 9] */
		uint32_t cpu0_btdm_wake_up_int_en         :  1; /**<bit[10 : 10] */
		uint32_t cpu0_touched_int_en              :  1; /**<bit[11 : 11] */
		uint32_t cpu0_i2s2_int_en                 :  1; /**<bit[12 : 12] */
		uint32_t cpu0_i2s3_int_en                 :  1; /**<bit[13 : 13] */
		uint32_t cpu0_spdif0_int_en               :  1; /**<bit[14 : 14] */
		uint32_t cpu0_cec_int_en                  :  1; /**<bit[15 : 15] */
		uint32_t cpu0_xdac0_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu0_xdac1_int_en                :  1; /**<bit[17 : 17] */
		uint32_t cpu0_otp_int_en                  :  1; /**<bit[18 : 18] */
		uint32_t cpu0_dpll_unlock_int_en          :  1; /**<bit[19 : 19] */
		uint32_t cpu0_dco_unlock_int_en           :  1; /**<bit[20 : 20] */
		uint32_t cpu0_usbplug_int_en              :  1; /**<bit[21 : 21] */
		uint32_t cpu0_rtc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu0_gpio_s_int_en               :  1; /**<bit[23 : 23] */
		uint32_t cpu0_uart2_int_en                :  1; /**<bit[24 : 24] */
		uint32_t cpu0_spi1_int_en                 :  1; /**<bit[25 : 25] */
		uint32_t cpu0_timer1_int_en               :  1; /**<bit[26 : 26] */
		uint32_t cpu0_spi3_int_en                 :  1; /**<bit[27 : 27] */
		uint32_t cpu0_scr_int_en                  :  1; /**<bit[28 : 28] */
		uint32_t cpu0_lin_int_en                  :  1; /**<bit[29 : 29] */
		uint32_t cpu0_can1_int_en                 :  1; /**<bit[30 : 30] */
		uint32_t cpu0_timer2_int_en               :  1; /**<bit[31 : 31] */
	};
	uint32_t cpu0_inten                       : 32; /**<bit[0 : 31] */
	uint32_t v;
} sys_cpu0_int_32_63_en_t;


