bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_struct.h
typedef volatile union {
	struct {
		uint32_t cpu0_timer3_int_en               :  1; /**<bit[0 : 0] */
		uint32_t cpu0_uart3_int_en                :  1; /**<bit[1 : 1] */
		uint32_t cpu0_spi2_int_en                 :  1; /**<bit[2 : 2] */
		uint32_t cpu0_uart4_int_en                :  1; /**<bit[3 : 3] */
		uint32_t cpu0_i2c3_int_en                 :  1; /**<bit[4 : 4] */
		uint32_t cpu0_hspl_int_en                 :  1; /**<bit[5 : 5] */
		uint32_t cpu0_bk24_int_en                 :  1; /**<bit[6 : 6] */
		uint32_t cpu0_irda1_int_en                :  1; /**<bit[7 : 7] */
		uint32_t cpu0_irda2_int_en                :  1; /**<bit[8 : 8] */
		uint32_t cpu0_irda3_int_en                :  1; /**<bit[9 : 9] */
		uint32_t cpu0_i3c_int_en                  :  1; /**<bit[10 : 10] */
		uint32_t cpu0_i2s4_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_spdif1_int_en               :  1; /**<bit[12 : 12] */
		uint32_t cpu0_int_m55sub_int_en           :  1; /**<bit[13 : 13] */
		uint32_t cpu0_mailbox_int_en              :  1; /**<bit[14 : 14] */
		uint32_t cpu0_ipi_int_en                  :  1; /**<bit[15 : 15] */
		uint32_t cpu0_vid_disp3_int_en            :  1; /**<bit[16 : 16] */
		uint32_t cpu0_vad_int_en                  :  1; /**<bit[17 : 17] */
		uint32_t cpu0_resv82_int_en               :  1; /**<bit[18 : 18] */
		uint32_t cpu0_resv83_int_en               :  1; /**<bit[19 : 19] */
		uint32_t cpu0_resv84_int_en               :  1; /**<bit[20 : 20] */
		uint32_t cpu0_resv85_int_en               :  1; /**<bit[21 : 21] */
		uint32_t cpu0_resv86_int_en               :  1; /**<bit[22 : 22] */
		uint32_t cpu0_resv87_int_en               :  1; /**<bit[23 : 23] */
		uint32_t cpu0_resv88_int_en               :  1; /**<bit[24 : 24] */
		uint32_t cpu0_resv89_int_en               :  1; /**<bit[25 : 25] */
		uint32_t cpu0_resv90_int_en               :  1; /**<bit[26 : 26] */
		uint32_t cpu0_resv91_int_en               :  1; /**<bit[27 : 27] */
		uint32_t cpu0_resv92_int_en               :  1; /**<bit[28 : 28] */
		uint32_t cpu0_resv93_int_en               :  1; /**<bit[29 : 29] */
		uint32_t cpu0_resv94_int_en               :  1; /**<bit[30 : 30] */
		uint32_t cpu0_resv95_int_en               :  1; /**<bit[31 : 31] */
	};
	uint32_t cpu0_inten                       : 32; /**<bit[0 : 31] */
	uint32_t v;
} sys_cpu0_int_64_95_en_t;


typedef volatile union {
	struct {
		uint32_t cpu1_inten                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_0_31_en_t;


typedef volatile union {
	struct {
		uint32_t cpu1_inten                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_32_63_en_t;


typedef volatile union {
	struct {
		uint32_t cpu1_inten                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_64_95_en_t;


typedef volatile union {
	struct {
		uint32_t m55sub_inten                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_m55sub_int_0_31_en_t;


typedef volatile union {
	struct {
		uint32_t m55sub_inten                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_m55sub_int_32_63_en_t;


typedef volatile union {
	struct {
		uint32_t m55sub_inten                     : 31; /**<bit[0 : 30] */
		uint32_t m55sub_wakeup                    :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_m55sub_int_64_95_en_t;


typedef volatile union {
	struct {
		uint32_t spsh_cfg                         : 10; /**<bit[0 : 9] */
		uint32_t spbh_cfg                         : 11; /**<bit[10 : 20] */
		uint32_t reserved_bit_21_23               :  3; /**<bit[21 : 23] */
		uint32_t set_key                          :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0x1e_t;


typedef volatile union {
	struct {
		uint32_t stph_cfg                         : 12; /**<bit[0 : 11] */
		uint32_t reserved_bit_12_23               : 12; /**<bit[12 : 23] */
		uint32_t set_key                          :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0x1f_t;


typedef volatile union {
	struct {
		uint32_t cpu0_dma0_nsec_int_st            :  1; /**<bit[0 : 0] */
		uint32_t cpu0_encp_sec_intr_int_st        :  1; /**<bit[1 : 1] */
		uint32_t cpu0_encp_nsec_intr_int_st       :  1; /**<bit[2 : 2] */
		uint32_t cpu0_timer_int_st                :  1; /**<bit[3 : 3] */
		uint32_t cpu0_uart_int_st                 :  1; /**<bit[4 : 4] */
		uint32_t cpu0_pwm0_int_st                 :  1; /**<bit[5 : 5] */
		uint32_t cpu0_i2c0_int_st                 :  1; /**<bit[6 : 6] */
		uint32_t cpu0_spi0_int_st                 :  1; /**<bit[7 : 7] */
		uint32_t cpu0_sadc_int_st                 :  1; /**<bit[8 : 8] */
		uint32_t cpu0_irda_int_st                 :  1; /**<bit[9 : 9] */
		uint32_t cpu0_l2_sec_int_st               :  1; /**<bit[10 : 10] */
		uint32_t cpu0_dma0_sec_int_st             :  1; /**<bit[11 : 11] */
		uint32_t cpu0_la_int_st                   :  1; /**<bit[12 : 12] */
		uint32_t cpu0_acomp0_int_st               :  1; /**<bit[13 : 13] */
		uint32_t cpu0_acomp1_int_st               :  1; /**<bit[14 : 14] */
		uint32_t cpu0_uart1_int_st                :  1; /**<bit[15 : 15] */
		uint32_t cpu0_cpu0_fpu_int_st             :  1; /**<bit[16 : 16] */
		uint32_t cpu0_cpu1_fpu_int_st             :  1; /**<bit[17 : 17] */
		uint32_t cpu0_can_int_st                  :  1; /**<bit[18 : 18] */
		uint32_t cpu0_l2_nsec_int_st              :  1; /**<bit[19 : 19] */
		uint32_t cpu0_vid_disp0_int_st            :  1; /**<bit[20 : 20] */
		uint32_t cpu0_ckmn_int_st                 :  1; /**<bit[21 : 21] */
		uint32_t cpu0_vid_disp1_int_st            :  1; /**<bit[22 : 22] */
		uint32_t cpu0_aud_int_st                  :  1; /**<bit[23 : 23] */
		uint32_t cpu0_i2s0_int_st                 :  1; /**<bit[24 : 24] */
		uint32_t cpu0_i2s1_int_st                 :  1; /**<bit[25 : 25] */
		uint32_t cpu0_vid_disp2_int_st            :  1; /**<bit[26 : 26] */
		uint32_t cpu0_ipchecksum_int_st           :  1; /**<bit[27 : 27] */
		uint32_t cpu0_thread_int_st               :  1; /**<bit[28 : 28] */
		uint32_t cpu0_phy_mbp_int_st              :  1; /**<bit[29 : 29] */
		uint32_t cpu0_phy_riu_int_st              :  1; /**<bit[30 : 30] */
		uint32_t cpu0_mac_int_tx_rx_timer_n_int_st :  1; /**<bit[31 : 31] */
	};
	uint32_t ints_status0                     : 32; /**<bit[0 : 31] */
	uint32_t v;
} sys_cpu0_int_0_31_status_t;


typedef volatile union {
	struct {
		uint32_t cpu0_mac_int_tx_rx_misc_n_int_st :  1; /**<bit[0 : 0] */
		uint32_t cpu0_mac_int_rx_trigger_n_int_st :  1; /**<bit[1 : 1] */
		uint32_t cpu0_mac_int_tx_trigger_n_int_st :  1; /**<bit[2 : 2] */
		uint32_t cpu0_mac_int_port_trigger_n_int_st :  1; /**<bit[3 : 3] */
		uint32_t cpu0_mac_int_gen_n_int_st        :  1; /**<bit[4 : 4] */
		uint32_t cpu0_gpio_ns_int_st              :  1; /**<bit[5 : 5] */
		uint32_t cpu0_int_mac_wakeup_int_st       :  1; /**<bit[6 : 6] */
		uint32_t cpu0_dm_irq_int_st               :  1; /**<bit[7 : 7] */
		uint32_t cpu0_ble_irq_int_st              :  1; /**<bit[8 : 8] */
		uint32_t cpu0_bt_irq_int_st               :  1; /**<bit[9 : 9] */
		uint32_t cpu0_btdm_wake_up_int_st         :  1; /**<bit[10 : 10] */
		uint32_t cpu0_touched_int_st              :  1; /**<bit[11 : 11] */
		uint32_t cpu0_i2s2_int_st                 :  1; /**<bit[12 : 12] */
		uint32_t cpu0_i2s3_int_st                 :  1; /**<bit[13 : 13] */
		uint32_t cpu0_spdif0_int_st               :  1; /**<bit[14 : 14] */
		uint32_t cpu0_cec_int_st                  :  1; /**<bit[15 : 15] */
		uint32_t cpu0_xdac0_int_st                :  1; /**<bit[16 : 16] */
		uint32_t cpu0_xdac1_int_st                :  1; /**<bit[17 : 17] */
		uint32_t cpu0_otp_int_st                  :  1; /**<bit[18 : 18] */
		uint32_t cpu0_dpll_unlock_int_st          :  1; /**<bit[19 : 19] */
		uint32_t cpu0_dco_unlock_int_st           :  1; /**<bit[20 : 20] */
		uint32_t cpu0_usbplug_int_st              :  1; /**<bit[21 : 21] */
		uint32_t cpu0_rtc_int_st                  :  1; /**<bit[22 : 22] */
		uint32_t cpu0_gpio_s_int_st               :  1; /**<bit[23 : 23] */
		uint32_t cpu0_uart2_int_st                :  1; /**<bit[24 : 24] */
		uint32_t cpu0_spi1_int_st                 :  1; /**<bit[25 : 25] */
		uint32_t cpu0_timer1_int_st               :  1; /**<bit[26 : 26] */
		uint32_t cpu0_spi3_int_st                 :  1; /**<bit[27 : 27] */
		uint32_t cpu0_scr_int_st                  :  1; /**<bit[28 : 28] */
		uint32_t cpu0_lin_int_st                  :  1; /**<bit[29 : 29] */
		uint32_t cpu0_can1_int_st                 :  1; /**<bit[30 : 30] */
		uint32_t cpu0_timer2_int_st               :  1; /**<bit[31 : 31] */
	};
	uint32_t ints_status1                     : 32; /**<bit[0 : 31] */
	uint32_t v;
} sys_cpu0_int_32_63_status_t;


typedef volatile union {
	struct {
		uint32_t cpu0_timer3_int_st               :  1; /**<bit[0 : 0] */
		uint32_t cpu0_uart3_int_st                :  1; /**<bit[1 : 1] */
		uint32_t cpu0_spi2_int_st                 :  1; /**<bit[2 : 2] */
		uint32_t cpu0_uart4_int_st                :  1; /**<bit[3 : 3] */
		uint32_t cpu0_i2c3_int_st                 :  1; /**<bit[4 : 4] */
		uint32_t cpu0_hspl_int_st                 :  1; /**<bit[5 : 5] */
		uint32_t cpu0_bk24_int_st                 :  1; /**<bit[6 : 6] */
		uint32_t cpu0_irda1_int_st                :  1; /**<bit[7 : 7] */
		uint32_t cpu0_irda2_int_st                :  1; /**<bit[8 : 8] */
		uint32_t cpu0_irda3_int_st                :  1; /**<bit[9 : 9] */
		uint32_t cpu0_i3c_int_st                  :  1; /**<bit[10 : 10] */
		uint32_t cpu0_i2s4_int_st                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_spdif1_int_st               :  1; /**<bit[12 : 12] */
		uint32_t cpu0_int_m55sub_int_st           :  1; /**<bit[13 : 13] */
		uint32_t cpu0_mailbox_int_st              :  1; /**<bit[14 : 14] */
		uint32_t cpu0_ipi_int_st                  :  1; /**<bit[15 : 15] */
		uint32_t cpu0_vid_disp3_int_st            :  1; /**<bit[16 : 16] */
		uint32_t cpu0_vad_int_st                  :  1; /**<bit[17 : 17] */
		uint32_t cpu0_resv82_int_st               :  1; /**<bit[18 : 18] */
		uint32_t cpu0_resv83_int_st               :  1; /**<bit[19 : 19] */
		uint32_t cpu0_resv84_int_st               :  1; /**<bit[20 : 20] */
		uint32_t cpu0_resv85_int_st               :  1; /**<bit[21 : 21] */
		uint32_t cpu0_resv86_int_st               :  1; /**<bit[22 : 22] */
		uint32_t cpu0_resv87_int_st               :  1; /**<bit[23 : 23] */
		uint32_t cpu0_resv88_int_st               :  1; /**<bit[24 : 24] */
		uint32_t cpu0_resv89_int_st               :  1; /**<bit[25 : 25] */
		uint32_t cpu0_resv90_int_st               :  1; /**<bit[26 : 26] */
		uint32_t cpu0_resv91_int_st               :  1; /**<bit[27 : 27] */
		uint32_t cpu0_resv92_int_st               :  1; /**<bit[28 : 28] */
		uint32_t cpu0_resv93_int_st               :  1; /**<bit[29 : 29] */
		uint32_t cpu0_resv94_int_st               :  1; /**<bit[30 : 30] */
		uint32_t cpu0_resv95_int_st               :  1; /**<bit[31 : 31] */
	};
	uint32_t ints_status2                     : 32; /**<bit[0 : 31] */
	uint32_t v;
} sys_cpu0_int_64_95_status_t;


typedef volatile union {
	struct {
		uint32_t ints_status3                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_0_31_status_t;


typedef volatile union {
	struct {
		uint32_t ints_status4                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_32_63_status_t;


typedef volatile union {
	struct {
		uint32_t ints_status5                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_64_95_status_t;


typedef volatile union {
	struct {
		uint32_t m55sub_status0                   : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_m55sub_int_0_31_status_t;


typedef volatile union {
	struct {
		uint32_t m55sub_status1                   : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_m55sub_int_32_63_status_t;


typedef volatile union {
	struct {
		uint32_t m55sub_status2                   : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_m55sub_int_64_95_status_t;


typedef volatile union {
	struct {
		uint32_t debug_gpio_ie                    : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0x2a_t;


typedef volatile union {
	struct {
		uint32_t debug_gpio_i                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0x2b_t;


typedef volatile union {
	struct {
		uint32_t cache_clean_mode                 :  1; /**<bit[0 : 0] */
		uint32_t cpu0_icache_clean_mode           :  1; /**<bit[1 : 1] */
		uint32_t cpu0_icache_clean_tag_sel        :  1; /**<bit[2 : 2] */
		uint32_t l2_cache_clean_mode              :  1; /**<bit[3 : 3] */
		uint32_t l2_cache_clean_tag_sel           :  2; /**<bit[4 : 5] */
		uint32_t reserved_6_23                    : 18; /**<bit[6 : 23] */
		uint32_t set_key                          :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0x2c_t;


typedef volatile union {
	struct {
		uint32_t spsl_cfg                         : 10; /**<bit[0 : 9] */
		uint32_t spbl_cfg                         : 11; /**<bit[10 : 20] */
		uint32_t reserved_bit_21_23               :  3; /**<bit[21 : 23] */
		uint32_t set_key                          :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0x2e_t;


typedef volatile union {
	struct {
		uint32_t stpl_cfg                         : 12; /**<bit[0 : 11] */
		uint32_t reserved_bit_12_23               : 12; /**<bit[12 : 23] */
		uint32_t set_key                          :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0x2f_t;


typedef volatile union {
	struct {
		uint32_t gpio_input_status0               : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_gpio_input_status0_t;


typedef volatile union {
	struct {
		uint32_t gpio_input_status1               : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_gpio_input_status1_t;


typedef volatile union {
	struct {
		uint32_t gpio_input_status2               :  8; /**<bit[0 : 7] */
		uint32_t reserved_bit_8_30                : 23; /**<bit[8 : 30] */
		uint32_t gpio_input_status_en             :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_gpio_input_status2_t;


typedef volatile union {
	struct {
		uint32_t acomp0_pwm0_sample_en            :  1; /**<bit[0 : 0] */
		uint32_t acomp1_pwm0_sample_en            :  1; /**<bit[1 : 1] */
		uint32_t reserved_2_15                    : 14; /**<bit[2 : 15] */
		uint32_t l2_dis_pwr_down_maint            :  1; /**<bit[16 : 16] */
		uint32_t l2_apb_violation_resp            :  1; /**<bit[17 : 17] */
		uint32_t cpu0_dbgen_l2_rst_dis            :  1; /**<bit[18 : 18] */
		uint32_t cpu1_dbgen_l2_rst_dis            :  1; /**<bit[19 : 19] */
		uint32_t reserved_20_23                   :  4; /**<bit[20 : 23] */
		uint32_t cpu0_wfe_src                     :  1; /**<bit[24 : 24] */
		uint32_t cpu0_wfe_pulse                   :  1; /**<bit[25 : 25] */
		uint32_t cpu1_wfe_src                     :  1; /**<bit[26 : 26] */
		uint32_t cpu1_wfe_pulse                   :  1; /**<bit[27 : 27] */
		uint32_t cpu0_sleeping_state              :  1; /**<bit[28 : 28] */
		uint32_t cpu0_deepsleep_state             :  1; /**<bit[29 : 29] */
		uint32_t cpu1_sleeping_state              :  1; /**<bit[30 : 30] */
		uint32_t cpu1_deepsleep_state             :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0x33_t;


typedef volatile union {
	struct {
		uint32_t cpu0_curpc                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_cpu0_curpc_t;


typedef volatile union {
	struct {
		uint32_t cpu0_faultstat_h                 : 11; /**<bit[0 : 10] */
		uint32_t reserved_11_31                   : 21; /**<bit[11 : 31] */
	};
	uint32_t v;
} sys_cpu0_faultstat_H_t;


typedef volatile union {
	struct {
		uint32_t cpu0_faultstat_l                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_cpu0_faultstat_L_t;


typedef volatile union {
	struct {
		uint32_t cpu0_intnum                      :  9; /**<bit[0 : 8] */
		uint32_t cpu0_currpri                     :  8; /**<bit[9 : 16] */
		uint32_t cpu0_currns                      :  1; /**<bit[17 : 17] */
		uint32_t cpu0_halted                      :  1; /**<bit[18 : 18] */
		uint32_t cpu0_nc_hready                   :  1; /**<bit[19 : 19] */
		uint32_t cpu_cache_m_hready               :  1; /**<bit[20 : 20] */
		uint32_t cpu0_resetn                      :  1; /**<bit[21 : 21] */
		uint32_t reserved_22_31                   : 10; /**<bit[22 : 31] */
	};
	uint32_t v;
} sys_cpu0_info_t;


typedef volatile union {
	struct {
		uint32_t dbug_config0                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_sys_debug_config0_t;


typedef volatile union {
	struct {
		uint32_t dbug_cfg1                        :  5; /**<bit[0 : 4] */
		uint32_t reserved_bit_5_31                : 27; /**<bit[5 : 31] */
	};
	uint32_t v;
} sys_sys_debug_config1_t;


typedef volatile union {
	struct {
		uint32_t anareg_stat                      : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_anareg_stat_t;


typedef volatile union {
	struct {
		uint32_t coresight_chn_gate_en            : 24; /**<bit[0 : 23] */
		uint32_t coresight_tpmaxdatasize          :  5; /**<bit[24 : 28] */
		uint32_t coresight_valid                  :  1; /**<bit[29 : 29] */
		uint32_t reserved_30_30                   :  1; /**<bit[30 : 30] */
		uint32_t anaregb_stat                     :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0x3b_t;


typedef volatile union {
	struct {
		uint32_t cpu1_curpc                       : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_cpu1_curpc_t;


typedef volatile union {
	struct {
		uint32_t cpu1_faultstat_h                 : 11; /**<bit[0 : 10] */
		uint32_t reserved_11_31                   : 21; /**<bit[11 : 31] */
	};
	uint32_t v;
} sys_cpu1_faultstat_H_t;


typedef volatile union {
	struct {
		uint32_t cpu1_faultstat_l                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_cpu1_faultstat_L_t;


typedef volatile union {
	struct {
		uint32_t cpu1_intnum                      :  9; /**<bit[0 : 8] */
		uint32_t cpu1_currpri                     :  8; /**<bit[9 : 16] */
		uint32_t cpu1_currns                      :  1; /**<bit[17 : 17] */
		uint32_t cpu1_halted                      :  1; /**<bit[18 : 18] */
		uint32_t cpu1_nc_hready                   :  1; /**<bit[19 : 19] */
		uint32_t reserved_20_20                   :  1; /**<bit[20 : 20] */
		uint32_t cpu1_resetn                      :  1; /**<bit[21 : 21] */
		uint32_t reserved_22_31                   : 10; /**<bit[22 : 31] */
	};
	uint32_t v;
} sys_cpu1_info_t;


typedef volatile union {
	struct {
		uint32_t dpll_tsten               :  1; /**<bit[0 : 0] */
		uint32_t cp                       :  3; /**<bit[1 : 3] */
		uint32_t spideten                 :  1; /**<bit[4 : 4] */
		uint32_t hvref                    :  2; /**<bit[5 : 6] */
		uint32_t lvref                    :  2; /**<bit[7 : 8] */
		uint32_t rzctrl26m                :  1; /**<bit[9 : 9] */
		uint32_t looprzctrl               :  4; /**<bit[10 : 13] */
		uint32_t rpc                      :  2; /**<bit[14 : 15] */
		uint32_t openloop_en              :  1; /**<bit[16 : 16] */
		uint32_t unlock_sel               :  1; /**<bit[17 : 17] */
		uint32_t rst_unlock               :  1; /**<bit[18 : 18] */
		uint32_t spitrig                  :  1; /**<bit[19 : 19] */
		uint32_t band                     :  1; /**<bit[20 : 20] */
		uint32_t band_1                   :  1; /**<bit[21 : 21] */
		uint32_t band_2                   :  3; /**<bit[22 : 24] */
		uint32_t bandmanual               :  1; /**<bit[25 : 25] */
		uint32_t dsptrig                  :  1; /**<bit[26 : 26] */
		uint32_t lpen_dpll                :  1; /**<bit[27 : 27] */
		uint32_t cksel                    :  2; /**<bit[28 : 29] */
		uint32_t bp_caldone               :  1; /**<bit[30 : 30] */
		uint32_t vselldo                  :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg0_t;


typedef volatile union {
	struct {
		uint32_t vcooffset                :  1; /**<bit[0 : 0] */
		uint32_t selpol                   :  1; /**<bit[1 : 1] */
		uint32_t dlysel                   :  2; /**<bit[2 : 3] */
		uint32_t edgesel_nck              :  1; /**<bit[4 : 4] */
		uint32_t nload_dlyen              :  1; /**<bit[5 : 5] */
		uint32_t cp                       :  3; /**<bit[6 : 8] */
		uint32_t spideten                 :  1; /**<bit[9 : 9] */
		uint32_t cben                     :  1; /**<bit[10 : 10] */
		uint32_t hvref                    :  2; /**<bit[11 : 12] */
		uint32_t lvref                    :  2; /**<bit[13 : 14] */
		uint32_t rzctrl26m                :  1; /**<bit[15 : 15] */
		uint32_t lpfrz                    :  4; /**<bit[16 : 19] */
		uint32_t rpc                      :  3; /**<bit[20 : 22] */
		uint32_t dpll_tsten               :  1; /**<bit[23 : 23] */
		uint32_t kctrl                    :  2; /**<bit[24 : 25] */
		uint32_t vsel_ldo                 :  2; /**<bit[26 : 27] */
		uint32_t div_sw                   :  1; /**<bit[28 : 28] */
		uint32_t bp_caldone               :  1; /**<bit[29 : 29] */
		uint32_t ck2xen                   :  1; /**<bit[30 : 30] */
		uint32_t int_mod                  :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg1_t;


typedef volatile union {
	struct {
		uint32_t nc_0_1                   :  2; /**<bit[0 : 1] */
		uint32_t vctrl_vsel               :  3; /**<bit[2 : 4] */
		uint32_t nc_5_7                   :  3; /**<bit[5 : 7] */
		uint32_t ck_tst_en                :  1; /**<bit[8 : 8] */
		uint32_t cktst_sel                :  2; /**<bit[9 : 10] */
		uint32_t dco_modecal              :  1; /**<bit[11 : 11] */
		uint32_t dco_modecal_1            :  1; /**<bit[12 : 12] */
		uint32_t anabufsel_rx             :  1; /**<bit[13 : 13] */
		uint32_t nc_14_15                 :  2; /**<bit[14 : 15] */
		uint32_t cktdinven                :  1; /**<bit[16 : 16] */
		uint32_t cktden                   :  1; /**<bit[17 : 17] */
		uint32_t nc_18_20                 :  3; /**<bit[18 : 20] */
		uint32_t xtal32k_dgliten          :  1; /**<bit[21 : 21] */
		uint32_t xtal32k_diven            :  1; /**<bit[22 : 22] */
		uint32_t rc32k_dgliten            :  1; /**<bit[23 : 23] */
		uint32_t rc32k_diven              :  1; /**<bit[24 : 24] */
		uint32_t nc_25_27                 :  3; /**<bit[25 : 27] */
		uint32_t unlock_sel_dco           :  1; /**<bit[28 : 28] */
		uint32_t rst_unlock_dco           :  1; /**<bit[29 : 29] */
		uint32_t refsamen                 :  1; /**<bit[30 : 30] */
		uint32_t adcdcsel                 :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg2_t;


