bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_struct.h
typedef volatile union {
	struct {
		uint32_t ctune                    :  8; /**<bit[0 : 7] */
		uint32_t core_hpen                :  1; /**<bit[8 : 8] */
		uint32_t ck_sel                   :  1; /**<bit[9 : 9] */
		uint32_t anabuf_sel_tx            :  1; /**<bit[10 : 10] */
		uint32_t pwd_xtalldo              :  1; /**<bit[11 : 11] */
		uint32_t iamp                     :  1; /**<bit[12 : 12] */
		uint32_t vddren                   :  1; /**<bit[13 : 13] */
		uint32_t xamp                     :  6; /**<bit[14 : 19] */
		uint32_t vosel                    :  5; /**<bit[20 : 24] */
		uint32_t en_xtalh_sleep           :  1; /**<bit[25 : 25] */
		uint32_t xtal40_en                :  1; /**<bit[26 : 26] */
		uint32_t bufictrl                 :  1; /**<bit[27 : 27] */
		uint32_t ibias_ctrl               :  2; /**<bit[28 : 29] */
		uint32_t icore_ctrl               :  2; /**<bit[30 : 31] */
	};
	uint32_t v;
} sys_ana_reg3_t;


typedef volatile union {
	struct {
		uint32_t nc_0_31                  : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ana_reg4_t;


typedef volatile union {
	struct {
		uint32_t vselldo1_dpll            :  1; /**<bit[0 : 0] */
		uint32_t en_xtall                 :  1; /**<bit[1 : 1] */
		uint32_t en_dco                   :  1; /**<bit[2 : 2] */
		uint32_t temp_gsel                :  1; /**<bit[3 : 3] */
		uint32_t en_temp                  :  1; /**<bit[4 : 4] */
		uint32_t en_dpll                  :  1; /**<bit[5 : 5] */
		uint32_t en_cb                    :  1; /**<bit[6 : 6] */
		uint32_t gpio_latch               :  1; /**<bit[7 : 7] */
		uint32_t bypassen                 :  1; /**<bit[8 : 8] */
		uint32_t nc_9_9                   :  1; /**<bit[9 : 9] */
		uint32_t rc32k_refclk_en          :  1; /**<bit[10 : 10] */
		uint32_t spilatchb_rc32k          :  1; /**<bit[11 : 11] */
		uint32_t rosc_disable             :  1; /**<bit[12 : 12] */
		uint32_t pwdaudpll                :  1; /**<bit[13 : 13] */
		uint32_t pwd_rosc_spi             :  1; /**<bit[14 : 14] */
		uint32_t nc_15_15                 :  1; /**<bit[15 : 15] */
		uint32_t itune_xtall              :  4; /**<bit[16 : 19] */
		uint32_t xtall_tsten              :  1; /**<bit[20 : 20] */
		uint32_t rosc_ten                 :  1; /**<bit[21 : 21] */
		uint32_t bcal_start               :  1; /**<bit[22 : 22] */
		uint32_t bcal_en                  :  1; /**<bit[23 : 23] */
		uint32_t bcal_sel                 :  3; /**<bit[24 : 26] */
		uint32_t vbias                    :  5; /**<bit[27 : 31] */
	};
	uint32_t v;
} sys_ana_reg5_t;


typedef volatile union {
	struct {
		uint32_t calib_interval           : 10; /**<bit[0 : 9] */
		uint32_t modify_interval          :  6; /**<bit[10 : 15] */
		uint32_t xtal_wakeup_time         :  4; /**<bit[16 : 19] */
		uint32_t spi_trig                 :  1; /**<bit[20 : 20] */
		uint32_t modifi_auto              :  1; /**<bit[21 : 21] */
		uint32_t calib_auto               :  1; /**<bit[22 : 22] */
		uint32_t cal_mode                 :  1; /**<bit[23 : 23] */
		uint32_t manu_ena                 :  1; /**<bit[24 : 24] */
		uint32_t manu_cin                 :  7; /**<bit[25 : 31] */
	};
	uint32_t v;
} sys_ana_reg6_t;


typedef volatile union {
	struct {
		uint32_t nsyn                     :  1; /**<bit[0 : 0] */
		uint32_t bandmanual               :  6; /**<bit[1 : 6] */
		uint32_t ckref_loop_sel           :  1; /**<bit[7 : 7] */
		uint32_t ioffs                    :  3; /**<bit[8 : 10] */
		uint32_t reset_nload              :  1; /**<bit[11 : 11] */
		uint32_t closeloop_en             :  1; /**<bit[12 : 12] */
		uint32_t ictrlm                   :  1; /**<bit[13 : 13] */
		uint32_t spi_rstn                 :  1; /**<bit[14 : 14] */
		uint32_t osccal_trig              :  1; /**<bit[15 : 15] */
		uint32_t manual                   :  1; /**<bit[16 : 16] */
		uint32_t diff                     :  3; /**<bit[17 : 19] */
		uint32_t ictrlmanual              :  3; /**<bit[20 : 22] */
		uint32_t cnti                     :  9; /**<bit[23 : 31] */
	};
	uint32_t v;
} sys_ana_reg7_t;


typedef volatile union {
	struct {
		uint32_t reserved_bit_0_30        : 31; /**<bit[0 : 30] */
		uint32_t n                        :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg8_t;


typedef volatile union {
	struct {
		uint32_t clk_sel                  :  1; /**<bit[0 : 0] */
		uint32_t coreldo_hp               :  1; /**<bit[1 : 1] */
		uint32_t dldohp                   :  1; /**<bit[2 : 2] */
		uint32_t t_vanaldosel             :  3; /**<bit[3 : 5] */
		uint32_t r_vanaldosel             :  3; /**<bit[6 : 8] */
		uint32_t en_trsw                  :  1; /**<bit[9 : 9] */
		uint32_t aldohp                   :  1; /**<bit[10 : 10] */
		uint32_t anacurlim                :  1; /**<bit[11 : 11] */
		uint32_t hsldo_hp                 :  1; /**<bit[12 : 12] */
		uint32_t pwd_hsldo                :  1; /**<bit[13 : 13] */
		uint32_t enfast_hsldo             :  1; /**<bit[14 : 14] */
		uint32_t vporsel                  :  1; /**<bit[15 : 15] */
		uint32_t valoldosel               :  3; /**<bit[16 : 18] */
		uint32_t alopowsel                :  1; /**<bit[19 : 19] */
		uint32_t en_fast_aloldo           :  1; /**<bit[20 : 20] */
		uint32_t aloldohp                 :  1; /**<bit[21 : 21] */
		uint32_t bgcal                    :  6; /**<bit[22 : 27] */
		uint32_t vbgcalmode               :  1; /**<bit[28 : 28] */
		uint32_t vbgcalstart              :  1; /**<bit[29 : 29] */
		uint32_t pwd_bgcal                :  1; /**<bit[30 : 30] */
		uint32_t spi_envbg                :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg9_t;


typedef volatile union {
	struct {
		uint32_t azcd_manual              :  6; /**<bit[0 : 5] */
		uint32_t azcdrefs                 :  3; /**<bit[6 : 8] */
		uint32_t spi_latch1v              :  1; /**<bit[9 : 9] */
		uint32_t digcurlim                :  1; /**<bit[10 : 10] */
		uint32_t rtc_wkrstn               :  1; /**<bit[11 : 11] */
		uint32_t rst_wks                  :  1; /**<bit[12 : 12] */
		uint32_t d_veasel1v               :  2; /**<bit[13 : 14] */
		uint32_t ensfsdd                  :  1; /**<bit[15 : 15] */
		uint32_t vcorehsel                :  4; /**<bit[16 : 19] */
		uint32_t vcorelsel                :  3; /**<bit[20 : 22] */
		uint32_t vlden                    :  1; /**<bit[23 : 23] */
		uint32_t en_fast_coreldo          :  1; /**<bit[24 : 24] */
		uint32_t pwdcoreldo               :  1; /**<bit[25 : 25] */
		uint32_t vdighsel                 :  3; /**<bit[26 : 28] */
		uint32_t vdiglsel                 :  2; /**<bit[29 : 30] */
		uint32_t vdd12lden                :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg10_t;


typedef volatile union {
	struct {
		uint32_t aldo_czsel               :  3; /**<bit[0 : 2] */
		uint32_t zldo_rzsel               :  2; /**<bit[3 : 4] */
		uint32_t azcdswvs                 :  3; /**<bit[5 : 7] */
		uint32_t aenzcddy                 :  1; /**<bit[8 : 8] */
		uint32_t aenzcdmsel               :  1; /**<bit[9 : 9] */
		uint32_t aenzcdcalib              :  1; /**<bit[10 : 10] */
		uint32_t en_corepsw               :  1; /**<bit[11 : 11] */
		uint32_t en_alopsw                :  1; /**<bit[12 : 12] */
		uint32_t vbatdetsel               :  2; /**<bit[13 : 14] */
		uint32_t spi_timerwken            :  1; /**<bit[15 : 15] */
		uint32_t spi_byp32pwd             :  1; /**<bit[16 : 16] */
		uint32_t sd                       :  1; /**<bit[17 : 17] */
		uint32_t timer_wkrstn             :  1; /**<bit[18 : 18] */
		uint32_t gpio_wkrst1v             :  1; /**<bit[19 : 19] */
		uint32_t ckfs                     :  2; /**<bit[20 : 21] */
		uint32_t ckintsel                 :  1; /**<bit[22 : 22] */
		uint32_t osccaltrig               :  1; /**<bit[23 : 23] */
		uint32_t mroscsel                 :  1; /**<bit[24 : 24] */
		uint32_t mrosci_cal               :  3; /**<bit[25 : 27] */
		uint32_t mrosccap_cal             :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_ana_reg11_t;


typedef volatile union {
	struct {
		uint32_t sfsr                     :  4; /**<bit[0 : 3] */
		uint32_t ensfsaa                  :  1; /**<bit[4 : 4] */
		uint32_t apfms                    :  5; /**<bit[5 : 9] */
		uint32_t atmpo_sel                :  2; /**<bit[10 : 11] */
		uint32_t ampoen                   :  1; /**<bit[12 : 12] */
		uint32_t enpowa                   :  1; /**<bit[13 : 13] */
		uint32_t avea_sel                 :  2; /**<bit[14 : 15] */
		uint32_t aforcepfm                :  1; /**<bit[16 : 16] */
		uint32_t acls                     :  3; /**<bit[17 : 19] */
		uint32_t aswrsten                 :  1; /**<bit[20 : 20] */
		uint32_t aripc                    :  3; /**<bit[21 : 23] */
		uint32_t arampc                   :  4; /**<bit[24 : 27] */
		uint32_t arampcen                 :  1; /**<bit[28 : 28] */
		uint32_t aenburst                 :  1; /**<bit[29 : 29] */
		uint32_t apfmen                   :  1; /**<bit[30 : 30] */
		uint32_t aldosel                  :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg12_t;


typedef volatile union {
	struct {
		uint32_t buckd_softst             :  4; /**<bit[0 : 3] */
		uint32_t denzcdcalib              :  1; /**<bit[4 : 4] */
		uint32_t dzcdmsel                 :  1; /**<bit[5 : 5] */
		uint32_t vbd_rstrtc_en            :  1; /**<bit[6 : 6] */
		uint32_t vddgpio_sel              :  1; /**<bit[7 : 7] */
		uint32_t dpfms                    :  5; /**<bit[8 : 12] */
		uint32_t dtmpo_sel                :  2; /**<bit[13 : 14] */
		uint32_t dmpoen                   :  1; /**<bit[15 : 15] */
		uint32_t dforcepfm                :  1; /**<bit[16 : 16] */
		uint32_t dcls                     :  3; /**<bit[17 : 19] */
		uint32_t dswrsten                 :  1; /**<bit[20 : 20] */
		uint32_t dripc                    :  3; /**<bit[21 : 23] */
		uint32_t drampc                   :  4; /**<bit[24 : 27] */
		uint32_t drampcen                 :  1; /**<bit[28 : 28] */
		uint32_t denburst                 :  1; /**<bit[29 : 29] */
		uint32_t dpfmen                   :  1; /**<bit[30 : 30] */
		uint32_t dldosel                  :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg13_t;


typedef volatile union {
	struct {
		uint32_t en_alo2corepsw           :  1; /**<bit[0 : 0] */
		uint32_t asoft_stc                :  4; /**<bit[1 : 4] */
		uint32_t dldo_czsel               :  3; /**<bit[5 : 7] */
		uint32_t dldo_rzsel               :  2; /**<bit[8 : 9] */
		uint32_t en_usbvcc18              :  1; /**<bit[10 : 10] */
		uint32_t en_usbvcc3v              :  1; /**<bit[11 : 11] */
		uint32_t vtrxspisel               :  2; /**<bit[12 : 13] */
		uint32_t denzcddy                 :  1; /**<bit[14 : 14] */
		uint32_t dzcd_swvs                :  3; /**<bit[15 : 17] */
		uint32_t dzcd_refs                :  3; /**<bit[18 : 20] */
		uint32_t dzcd_manu                :  6; /**<bit[21 : 26] */
		uint32_t vpsramsel                :  4; /**<bit[27 : 30] */
		uint32_t enpsram                  :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg14_t;


typedef volatile union {
	struct {
		uint32_t gpiowken                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ana_reg15_t;


typedef volatile union {
	struct {
		uint32_t rtc_set                  :  8; /**<bit[0 : 7] */
		uint32_t nc_8_10                  :  3; /**<bit[8 : 10] */
		uint32_t vcorehssel               :  4; /**<bit[11 : 14] */
		uint32_t vbuckhssel               :  3; /**<bit[15 : 17] */
		uint32_t hsenfast                 :  1; /**<bit[18 : 18] */
		uint32_t enhspw                   :  1; /**<bit[19 : 19] */
		uint32_t buckhs_soft_stc          :  4; /**<bit[20 : 23] */
		uint32_t hs_veasel                :  2; /**<bit[24 : 25] */
		uint32_t hszcd_manual             :  6; /**<bit[26 : 31] */
	};
	uint32_t v;
} sys_ana_reg16_t;


typedef volatile union {
	struct {
		uint32_t rtc_set                  : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ana_reg17_t;


typedef volatile union {
	struct {
		uint32_t timer_set                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ana_reg18_t;


typedef volatile union {
	struct {
		uint32_t hsenzcddy                :  1; /**<bit[0 : 0] */
		uint32_t hsenzcdcalib             :  1; /**<bit[1 : 1] */
		uint32_t hszcdswvs                :  3; /**<bit[2 : 4] */
		uint32_t hszcdrefs                :  3; /**<bit[5 : 7] */
		uint32_t hszcdmsel                :  1; /**<bit[8 : 8] */
		uint32_t hspfms                   :  5; /**<bit[9 : 13] */
		uint32_t hstmpo_sel               :  2; /**<bit[14 : 15] */
		uint32_t hsmpoen                  :  1; /**<bit[16 : 16] */
		uint32_t hsforcepfm               :  1; /**<bit[17 : 17] */
		uint32_t hscls                    :  3; /**<bit[18 : 20] */
		uint32_t hsswrsten                :  1; /**<bit[21 : 21] */
		uint32_t hsripc                   :  3; /**<bit[22 : 24] */
		uint32_t hsrampc                  :  4; /**<bit[25 : 28] */
		uint32_t hsrampcen                :  1; /**<bit[29 : 29] */
		uint32_t hsenburst                :  1; /**<bit[30 : 30] */
		uint32_t hspfmen                  :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg19_t;


typedef volatile union {
	struct {
		uint32_t iselaud                  :  1; /**<bit[0 : 0] */
		uint32_t audck_rlcen              :  1; /**<bit[1 : 1] */
		uint32_t lchckinven               :  1; /**<bit[2 : 2] */
		uint32_t enaudbias                :  1; /**<bit[3 : 3] */
		uint32_t enadcbias                :  1; /**<bit[4 : 4] */
		uint32_t enmicbias                :  1; /**<bit[5 : 5] */
		uint32_t adcckinven               :  1; /**<bit[6 : 6] */
		uint32_t spi                      :  1; /**<bit[7 : 7] */
		uint32_t adctsten                 :  1; /**<bit[8 : 8] */
		uint32_t micbias_trm              :  2; /**<bit[9 : 10] */
		uint32_t micbias_voc              :  5; /**<bit[11 : 15] */
		uint32_t vrefsel                  :  1; /**<bit[16 : 16] */
		uint32_t capsw                    :  5; /**<bit[17 : 21] */
		uint32_t adcref_sel               :  2; /**<bit[22 : 23] */
		uint32_t adcvcmsel                :  2; /**<bit[24 : 25] */
		uint32_t spi_1                    :  1; /**<bit[26 : 26] */
		uint32_t audadjref                :  5; /**<bit[27 : 31] */
	};
	uint32_t v;
} sys_ana_reg20_t;


typedef volatile union {
	struct {
		uint32_t isel_mic1                :  2; /**<bit[0 : 1] */
		uint32_t micirsel1_mic1           :  1; /**<bit[2 : 2] */
		uint32_t vcmsel_mic1              :  1; /**<bit[3 : 3] */
		uint32_t enfsr_mic1               :  1; /**<bit[4 : 4] */
		uint32_t enopoclip_mic1           :  1; /**<bit[5 : 5] */
		uint32_t da2aden_mic1             :  1; /**<bit[6 : 6] */
		uint32_t imatch_mic1              :  4; /**<bit[7 : 10] */
		uint32_t imatch_en_mic1           :  1; /**<bit[11 : 11] */
		uint32_t dccompen_mic1            :  1; /**<bit[12 : 12] */
		uint32_t micsingleen_mic1         :  1; /**<bit[13 : 13] */
		uint32_t nc_14_14                 :  1; /**<bit[14 : 14] */
		uint32_t micgain_mic1             :  4; /**<bit[15 : 18] */
		uint32_t nc_19_23                 :  5; /**<bit[19 : 23] */
		uint32_t dwamode_mic1             :  1; /**<bit[24 : 24] */
		uint32_t nc_25_26                 :  2; /**<bit[25 : 26] */
		uint32_t rstsel_mic1              :  1; /**<bit[27 : 27] */
		uint32_t micen_mic1               :  1; /**<bit[28 : 28] */
		uint32_t rst_mic1                 :  1; /**<bit[29 : 29] */
		uint32_t bpdwa1v_mic1             :  1; /**<bit[30 : 30] */
		uint32_t hcen1stg_mic1            :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg21_t;


typedef volatile union {
	struct {
		uint32_t inbuffer_isel            :  2; /**<bit[0 : 1] */
		uint32_t gadc_offset_en           :  1; /**<bit[2 : 2] */
		uint32_t gadc_vref_sel            :  1; /**<bit[3 : 3] */
		uint32_t gadc_bufamp_isel         :  3; /**<bit[4 : 6] */
		uint32_t gadc_preamp_isel         :  3; /**<bit[7 : 9] */
		uint32_t gadc_comp_isel           :  3; /**<bit[10 : 12] */
		uint32_t gadc_bscalsaw            :  3; /**<bit[13 : 15] */
		uint32_t gadc_vncalsaw            :  3; /**<bit[16 : 18] */
		uint32_t gadc_vpcalsaw            :  3; /**<bit[19 : 21] */
		uint32_t irefen                   :  1; /**<bit[22 : 22] */
		uint32_t gadc_vbg_sel             :  1; /**<bit[23 : 23] */
		uint32_t gadc_clk_rlten           :  1; /**<bit[24 : 24] */
		uint32_t gadc_calintsaw_en        :  1; /**<bit[25 : 25] */
		uint32_t gadc_clk_sel             :  1; /**<bit[26 : 26] */
		uint32_t gadc_clk_in              :  1; /**<bit[27 : 27] */
		uint32_t gadc_calcap_ch           :  2; /**<bit[28 : 29] */
		uint32_t gadc_inbuf_en            :  1; /**<bit[30 : 30] */
		uint32_t gadc_en_spi              :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg22_t;


typedef volatile union {
	struct {
		uint32_t vadckinven               :  1; /**<bit[0 : 0] */
		uint32_t vadrefsel                :  1; /**<bit[1 : 1] */
		uint32_t vad_rstn                 :  1; /**<bit[2 : 2] */
		uint32_t vad_viniset              :  1; /**<bit[3 : 3] */
		uint32_t vad_cstrm                :  2; /**<bit[4 : 5] */
		uint32_t vad_cftrm                :  2; /**<bit[6 : 7] */
		uint32_t vad_en                   :  1; /**<bit[8 : 8] */
		uint32_t vad_ctrl0                : 23; /**<bit[9 : 31] */
	};
	uint32_t v;
} sys_ana_reg23_t;


typedef volatile union {
	struct {
		uint32_t vad_ctrl1                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ana_reg24_t;


typedef volatile union {
	struct {
		uint32_t int_mod                  :  1; /**<bit[0 : 0] */
		uint32_t nsyn                     :  1; /**<bit[1 : 1] */
		uint32_t open_enb                 :  1; /**<bit[2 : 2] */
		uint32_t reset                    :  1; /**<bit[3 : 3] */
		uint32_t ioffsetl                 :  3; /**<bit[4 : 6] */
		uint32_t lpfrz                    :  4; /**<bit[7 : 10] */
		uint32_t vsel                     :  3; /**<bit[11 : 13] */
		uint32_t vsel_cal                 :  1; /**<bit[14 : 14] */
		uint32_t pwd_lockdet              :  1; /**<bit[15 : 15] */
		uint32_t lockdet_bypass           :  1; /**<bit[16 : 16] */
		uint32_t ckref_loop_sel           :  1; /**<bit[17 : 17] */
		uint32_t spi_trigger              :  1; /**<bit[18 : 18] */
		uint32_t manual                   :  1; /**<bit[19 : 19] */
		uint32_t test_ckaudio_en          :  1; /**<bit[20 : 20] */
		uint32_t ck2xen                   :  1; /**<bit[21 : 21] */
		uint32_t icp                      :  2; /**<bit[22 : 23] */
		uint32_t cktst_sel                :  1; /**<bit[24 : 24] */
		uint32_t edgesel_nck              :  1; /**<bit[25 : 25] */
		uint32_t nloaddlyen               :  1; /**<bit[26 : 26] */
		uint32_t bypass_caldone_auto      :  1; /**<bit[27 : 27] */
		uint32_t cal_res_spi              :  3; /**<bit[28 : 30] */
		uint32_t audioen                  :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg25_t;


typedef volatile union {
	struct {
		uint32_t n                        : 30; /**<bit[0 : 29] */
		uint32_t calres_spien             :  1; /**<bit[30 : 30] */
		uint32_t calrefen                 :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg26_t;


typedef volatile union {
	struct {
		uint32_t isel_mic2                :  2; /**<bit[0 : 1] */
		uint32_t micirsel1_mic2           :  1; /**<bit[2 : 2] */
		uint32_t vcmsel_mic2              :  1; /**<bit[3 : 3] */
		uint32_t enfsr_mic2               :  1; /**<bit[4 : 4] */
		uint32_t enopoclip_mic2           :  1; /**<bit[5 : 5] */
		uint32_t da2aden_mic2             :  1; /**<bit[6 : 6] */
		uint32_t imatch_mic2              :  4; /**<bit[7 : 10] */
		uint32_t imatch_en_mic2           :  1; /**<bit[11 : 11] */
		uint32_t dccompen_mic2            :  1; /**<bit[12 : 12] */
		uint32_t micsingleen_mic2         :  1; /**<bit[13 : 13] */
		uint32_t nc_14_14                 :  1; /**<bit[14 : 14] */
		uint32_t micgain_mic2             :  4; /**<bit[15 : 18] */
		uint32_t nc_19_23                 :  5; /**<bit[19 : 23] */
		uint32_t dwamode_mic2             :  1; /**<bit[24 : 24] */
		uint32_t nc_25_26                 :  2; /**<bit[25 : 26] */
		uint32_t rstsel_mic2              :  1; /**<bit[27 : 27] */
		uint32_t micen_mic2               :  1; /**<bit[28 : 28] */
		uint32_t rst_mic2                 :  1; /**<bit[29 : 29] */
		uint32_t bpdwa1v_mic2             :  1; /**<bit[30 : 30] */
		uint32_t hcen1stg_mic2            :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg27_t;


typedef volatile union {
	struct {
		uint32_t isel_mic3                :  2; /**<bit[0 : 1] */
		uint32_t micirsel1_mic3           :  1; /**<bit[2 : 2] */
		uint32_t vcmsel_mic3              :  1; /**<bit[3 : 3] */
		uint32_t enfsr_mic3               :  1; /**<bit[4 : 4] */
		uint32_t enopoclip_mic3           :  1; /**<bit[5 : 5] */
		uint32_t da2aden_mic3             :  1; /**<bit[6 : 6] */
		uint32_t imatch_mic3              :  4; /**<bit[7 : 10] */
		uint32_t imatch_en_mic3           :  1; /**<bit[11 : 11] */
		uint32_t dccompen_mic3            :  1; /**<bit[12 : 12] */
		uint32_t micsingleen_mic3         :  1; /**<bit[13 : 13] */
		uint32_t nc_14_14                 :  1; /**<bit[14 : 14] */
		uint32_t micgain_mic3             :  4; /**<bit[15 : 18] */
		uint32_t nc_19_23                 :  5; /**<bit[19 : 23] */
		uint32_t dwamode_mic3             :  1; /**<bit[24 : 24] */
		uint32_t nc_25_26                 :  2; /**<bit[25 : 26] */
		uint32_t rstsel_mic3              :  1; /**<bit[27 : 27] */
		uint32_t micen_mic3               :  1; /**<bit[28 : 28] */
		uint32_t rst_mic3                 :  1; /**<bit[29 : 29] */
		uint32_t bpdwa1v_mic3             :  1; /**<bit[30 : 30] */
		uint32_t hcen1stg_mic3            :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg28_t;


typedef volatile union {
	struct {
		uint32_t hpdac                    :  1; /**<bit[0 : 0] */
		uint32_t iselstg                  :  1; /**<bit[1 : 1] */
		uint32_t oscdac                   :  2; /**<bit[2 : 3] */
		uint32_t ocendac                  :  1; /**<bit[4 : 4] */
		uint32_t vseldco                  :  1; /**<bit[5 : 5] */
		uint32_t srsel                    :  1; /**<bit[6 : 6] */
		uint32_t hpoen                    :  1; /**<bit[7 : 7] */
		uint32_t lbwen                    :  1; /**<bit[8 : 8] */
		uint32_t calsel                   :  1; /**<bit[9 : 9] */
		uint32_t bp2vldo                  :  1; /**<bit[10 : 10] */
		uint32_t dcochg                   :  2; /**<bit[11 : 12] */
		uint32_t diffen                   :  1; /**<bit[13 : 13] */
		uint32_t endaccal                 :  1; /**<bit[14 : 14] */
		uint32_t rendcoc                  :  1; /**<bit[15 : 15] */
		uint32_t lendcoc                  :  1; /**<bit[16 : 16] */
		uint32_t renvcmd                  :  1; /**<bit[17 : 17] */
		uint32_t lenvcmd                  :  1; /**<bit[18 : 18] */
		uint32_t dacdrven                 :  1; /**<bit[19 : 19] */
		uint32_t dacren                   :  1; /**<bit[20 : 20] */
		uint32_t daclen                   :  1; /**<bit[21 : 21] */
		uint32_t dacg                     :  4; /**<bit[22 : 25] */
		uint32_t dacmute                  :  1; /**<bit[26 : 26] */
		uint32_t dacdwamode_sel           :  1; /**<bit[27 : 27] */
		uint32_t ckpsel                   :  1; /**<bit[28 : 28] */
		uint32_t nc_29_31                 :  3; /**<bit[29 : 31] */
	};
	uint32_t v;
} sys_ana_reg29_t;


