bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_struct.h
typedef volatile union {
	struct {
		uint32_t lmdcin                   :  8; /**<bit[0 : 7] */
		uint32_t rmdcin                   :  8; /**<bit[8 : 15] */
		uint32_t spirst_ovc               :  1; /**<bit[16 : 16] */
		uint32_t enidacr                  :  1; /**<bit[17 : 17] */
		uint32_t enidacl                  :  1; /**<bit[18 : 18] */
		uint32_t dac3rdhc0v9              :  1; /**<bit[19 : 19] */
		uint32_t hc2s                     :  1; /**<bit[20 : 20] */
		uint32_t sng_fb_en                :  1; /**<bit[21 : 21] */
		uint32_t rfb_ctrl                 :  1; /**<bit[22 : 22] */
		uint32_t enbs                     :  1; /**<bit[23 : 23] */
		uint32_t calck_sel0v9             :  1; /**<bit[24 : 24] */
		uint32_t bpdwa0v9                 :  1; /**<bit[25 : 25] */
		uint32_t looprst0v9               :  1; /**<bit[26 : 26] */
		uint32_t oct0v9                   :  2; /**<bit[27 : 28] */
		uint32_t sout0v9                  :  1; /**<bit[29 : 29] */
		uint32_t hc0v9                    :  2; /**<bit[30 : 31] */
	};
	uint32_t v;
} sys_ana_reg30_t;


typedef volatile union {
	struct {
		uint32_t nc_0_31                  : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ana_reg31_t;


typedef volatile union {
	struct {
		uint32_t nc_0_2                   :  3; /**<bit[0 : 2] */
		uint32_t vad_ck_sel               :  1; /**<bit[3 : 3] */
		uint32_t int_sel                  :  1; /**<bit[4 : 4] */
		uint32_t ldoen                    :  1; /**<bit[5 : 5] */
		uint32_t ldoctrl                  :  1; /**<bit[6 : 6] */
		uint32_t ibctrl                   :  1; /**<bit[7 : 7] */
		uint32_t rstb_dig                 :  1; /**<bit[8 : 8] */
		uint32_t en_vtest_sel             :  1; /**<bit[9 : 9] */
		uint32_t en_adcmod                :  1; /**<bit[10 : 10] */
		uint32_t en_out_test              :  1; /**<bit[11 : 11] */
		uint32_t nc_12_12                 :  1; /**<bit[12 : 12] */
		uint32_t sel_seri_cap             :  1; /**<bit[13 : 13] */
		uint32_t en_seri_cap              :  1; /**<bit[14 : 14] */
		uint32_t cal_ctrl                 :  2; /**<bit[15 : 16] */
		uint32_t cal_vth                  :  3; /**<bit[17 : 19] */
		uint32_t crg                      :  2; /**<bit[20 : 21] */
		uint32_t vrefs                    :  4; /**<bit[22 : 25] */
		uint32_t gain_s                   :  4; /**<bit[26 : 29] */
		uint32_t td_latch                 :  1; /**<bit[30 : 30] */
		uint32_t pwd_td                   :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg32_t;


typedef volatile union {
	struct {
		uint32_t test_number              :  4; /**<bit[0 : 3] */
		uint32_t test_period              :  4; /**<bit[4 : 7] */
		uint32_t chs                      : 16; /**<bit[8 : 23] */
		uint32_t chs_sel_cal              :  4; /**<bit[24 : 27] */
		uint32_t cal_done_clr             :  1; /**<bit[28 : 28] */
		uint32_t en_cal_force             :  1; /**<bit[29 : 29] */
		uint32_t en_cal_auto              :  1; /**<bit[30 : 30] */
		uint32_t en_scan                  :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg33_t;


typedef volatile union {
	struct {
		uint32_t int_en                   : 17; /**<bit[0 : 16] */
		uint32_t nc_17_17                 :  1; /**<bit[17 : 17] */
		uint32_t modsel_spi               :  1; /**<bit[18 : 18] */
		uint32_t cal_number               :  4; /**<bit[19 : 22] */
		uint32_t cl_period                :  9; /**<bit[23 : 31] */
	};
	uint32_t v;
} sys_ana_reg34_t;


typedef volatile union {
	struct {
		uint32_t int_clr                  : 17; /**<bit[0 : 16] */
		uint32_t nc_17_17                 :  1; /**<bit[17 : 17] */
		uint32_t int_clr_sel              :  1; /**<bit[18 : 18] */
		uint32_t en_lpmod                 :  1; /**<bit[19 : 19] */
		uint32_t en_testcmp               :  1; /**<bit[20 : 20] */
		uint32_t en_man_wr                :  1; /**<bit[21 : 21] */
		uint32_t en_manmode               :  1; /**<bit[22 : 22] */
		uint32_t cap_calspi               :  9; /**<bit[23 : 31] */
	};
	uint32_t v;
} sys_ana_reg35_t;


typedef volatile union {
	struct {
		uint32_t int_clr_cal              : 16; /**<bit[0 : 15] */
		uint32_t int_en_cal               : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} sys_ana_reg36_t;


typedef volatile union {
	struct {
		uint32_t reset                    :  1; /**<bit[0 : 0] */
		uint32_t clear_int                :  1; /**<bit[1 : 1] */
		uint32_t xmin_init                :  1; /**<bit[2 : 2] */
		uint32_t gain                     :  4; /**<bit[3 : 6] */
		uint32_t alphal                   :  3; /**<bit[7 : 9] */
		uint32_t alphas                   :  3; /**<bit[10 : 12] */
		uint32_t lpfn                     :  3; /**<bit[13 : 15] */
		uint32_t hpfn                     :  3; /**<bit[16 : 18] */
		uint32_t lpf_bypass               :  1; /**<bit[19 : 19] */
		uint32_t hpf_bypass               :  1; /**<bit[20 : 20] */
		uint32_t is_abs                   :  1; /**<bit[21 : 21] */
		uint32_t dir                      :  1; /**<bit[22 : 22] */
		uint32_t nc_23_31                 :  9; /**<bit[23 : 31] */
	};
	uint32_t v;
} sys_ana_reg37_t;


typedef volatile union {
	struct {
		uint32_t alpha                    :  8; /**<bit[0 : 7] */
		uint32_t comp                     : 12; /**<bit[8 : 19] */
		uint32_t cntn                     : 12; /**<bit[20 : 31] */
	};
	uint32_t v;
} sys_ana_reg38_t;


typedef volatile union {
	struct {
		uint32_t enspi_i                  :  1; /**<bit[0 : 0] */
		uint32_t ck_edge_i                :  1; /**<bit[1 : 1] */
		uint32_t outbuff_isel_i           :  3; /**<bit[2 : 4] */
		uint32_t refbuff_isel_i           :  3; /**<bit[5 : 7] */
		uint32_t cap_fb_sel_i             :  4; /**<bit[8 : 11] */
		uint32_t gain_sel_i               :  3; /**<bit[12 : 14] */
		uint32_t vref_cal_sel_i           :  5; /**<bit[15 : 19] */
		uint32_t cap_cal_sel_i            :  4; /**<bit[20 : 23] */
		uint32_t cal_direction_i          :  1; /**<bit[24 : 24] */
		uint32_t endigspi_sel_i           :  1; /**<bit[25 : 25] */
		uint32_t nc_26_31                 :  6; /**<bit[26 : 31] */
	};
	uint32_t v;
} sys_ana_reg39_t;


typedef volatile union {
	struct {
		uint32_t enspi_q                  :  1; /**<bit[0 : 0] */
		uint32_t ck_edge_q                :  1; /**<bit[1 : 1] */
		uint32_t outbuff_qsel_q           :  3; /**<bit[2 : 4] */
		uint32_t refbuff_qsel_q           :  3; /**<bit[5 : 7] */
		uint32_t cap_fb_sel_q             :  4; /**<bit[8 : 11] */
		uint32_t gain_sel_q               :  3; /**<bit[12 : 14] */
		uint32_t vref_cal_sel_q           :  5; /**<bit[15 : 19] */
		uint32_t cap_cal_sel_q            :  4; /**<bit[20 : 23] */
		uint32_t cal_direction_q          :  1; /**<bit[24 : 24] */
		uint32_t endigspi_sel_q           :  1; /**<bit[25 : 25] */
		uint32_t nc_26_31                 :  6; /**<bit[26 : 31] */
	};
	uint32_t v;
} sys_ana_reg40_t;


typedef volatile union {
	struct {
		uint32_t nc_0_10                  : 11; /**<bit[0 : 10] */
		uint32_t vsel_auxldo3v            :  4; /**<bit[11 : 14] */
		uint32_t vsel_auxldo2p8v          :  4; /**<bit[15 : 18] */
		uint32_t vsel_auxldo1p8v          :  4; /**<bit[19 : 22] */
		uint32_t vsel_auxldo1p2v          :  3; /**<bit[23 : 25] */
		uint32_t swb_auxldo3v             :  1; /**<bit[26 : 26] */
		uint32_t swb_auxldo2p8v           :  1; /**<bit[27 : 27] */
		uint32_t en_auxldo3v              :  1; /**<bit[28 : 28] */
		uint32_t en_auxldo2p8v            :  1; /**<bit[29 : 29] */
		uint32_t en_auxldo_1p8v           :  1; /**<bit[30 : 30] */
		uint32_t en_auxldo_1p2v           :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg41_t;


typedef volatile union {
	struct {
		uint32_t nc_0_9                   : 10; /**<bit[0 : 9] */
		uint32_t dslep_disable            :  1; /**<bit[10 : 10] */
		uint32_t en_vout                  :  1; /**<bit[11 : 11] */
		uint32_t vusbsel                  :  2; /**<bit[12 : 13] */
		uint32_t usbnen_dn                :  4; /**<bit[14 : 17] */
		uint32_t usbpen_dn                :  4; /**<bit[18 : 21] */
		uint32_t usbnen_dp                :  4; /**<bit[22 : 25] */
		uint32_t usbpen_dp                :  4; /**<bit[26 : 29] */
		uint32_t usb_speed                :  1; /**<bit[30 : 30] */
		uint32_t pwd_usb                  :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg42_t;


typedef volatile union {
	struct {
		uint32_t en_lpdac_a_votest        :  1; /**<bit[0 : 0] */
		uint32_t acmp_clr_out_a           :  1; /**<bit[1 : 1] */
		uint32_t acmp_chsel_a             :  4; /**<bit[2 : 5] */
		uint32_t acmp_hystsel_a           :  2; /**<bit[6 : 7] */
		uint32_t acmp_npmd_a              :  1; /**<bit[8 : 8] */
		uint32_t acmp_hpmd_a              :  1; /**<bit[9 : 9] */
		uint32_t en_anacomp_a             :  1; /**<bit[10 : 10] */
		uint32_t vbg_sel_lpdac_a          :  1; /**<bit[11 : 11] */
		uint32_t en_lpdac_a               :  1; /**<bit[12 : 12] */
		uint32_t comp_a_vosel             :  2; /**<bit[13 : 14] */
		uint32_t nc_15_15                 :  1; /**<bit[15 : 15] */
		uint32_t en_lpdac_b_votest        :  1; /**<bit[16 : 16] */
		uint32_t acmp_clr_out_b           :  1; /**<bit[17 : 17] */
		uint32_t acmp_chsel_b             :  4; /**<bit[18 : 21] */
		uint32_t acmp_hystsel_b           :  2; /**<bit[22 : 23] */
		uint32_t acmp_npmd_b              :  1; /**<bit[24 : 24] */
		uint32_t acmp_hpmd_b              :  1; /**<bit[25 : 25] */
		uint32_t en_anacomp_b             :  1; /**<bit[26 : 26] */
		uint32_t vbg_sel_lpdac_b          :  1; /**<bit[27 : 27] */
		uint32_t en_lpdac_b               :  1; /**<bit[28 : 28] */
		uint32_t comp_b_vosel             :  2; /**<bit[29 : 30] */
		uint32_t nc_31_31                 :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg43_t;


typedef volatile union {
	struct {
		uint32_t din_lpdac_a              :  8; /**<bit[0 : 7] */
		uint32_t din_lpdac_b              :  8; /**<bit[8 : 15] */
		uint32_t nc_16_31                 : 16; /**<bit[16 : 31] */
	};
	uint32_t v;
} sys_ana_reg44_t;


typedef volatile union {
	struct {
		uint32_t nc_0_31                  : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ana_reg45_t;


typedef volatile union {
	struct {
		uint32_t nc_0_31                  : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ana_reg46_t;


typedef volatile union {
	struct {
		uint32_t nc_0_31                  : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_ana_reg47_t;

typedef volatile struct {
	volatile sys_device_id_t device_id;
	volatile sys_version_id_t version_id;
	volatile sys_cpu_storage_connect_op_select_t cpu_storage_connect_op_select;
	volatile sys_cpu_current_run_status_t cpu_current_run_status;
	volatile sys_cpu0_int_halt_clk_op_t cpu0_int_halt_clk_op;
	volatile sys_cpu1_int_halt_clk_op_t cpu1_int_halt_clk_op;
	volatile uint32_t rsv_6_7[2];
	volatile sys_cpu_clk_div_mode1_t cpu_clk_div_mode1;
	volatile sys_cpu_clk_div_mode2_t cpu_clk_div_mode2;
	volatile sys_cpu_clk_div_mode3_t cpu_clk_div_mode3;
	volatile sys_cpu_anaspi_freq_t cpu_anaspi_freq;
	volatile sys_cpu_device_clk_enable_t cpu_device_clk_enable;
	volatile sys_reserver_reg0xd_t reserver_reg0xd;
	volatile uint32_t rsv_e_e[1];
	volatile sys_reserver_reg0xf_t reserver_reg0xf;
	volatile sys_reserver_reg0x10_t reserver_reg0x10;
	volatile sys_cpu_power_sleep_wakeup_t cpu_power_sleep_wakeup;
	volatile uint32_t rsv_12_13[2];
	volatile sys_cpu0_int_0_31_en_t cpu0_int_0_31_en;
	volatile sys_cpu0_int_32_63_en_t cpu0_int_32_63_en;
	volatile sys_cpu0_int_64_95_en_t cpu0_int_64_95_en;
	volatile sys_cpu1_int_0_31_en_t cpu1_int_0_31_en;
	volatile sys_cpu1_int_32_63_en_t cpu1_int_32_63_en;
	volatile sys_cpu1_int_64_95_en_t cpu1_int_64_95_en;
	volatile sys_m55sub_int_0_31_en_t m55sub_int_0_31_en;
	volatile sys_m55sub_int_32_63_en_t m55sub_int_32_63_en;
	volatile sys_m55sub_int_64_95_en_t m55sub_int_64_95_en;
	volatile uint32_t rsv_1d_1d[1];
	volatile sys_reserver_reg0x1e_t reserver_reg0x1e;
	volatile sys_reserver_reg0x1f_t reserver_reg0x1f;
	volatile sys_cpu0_int_0_31_status_t cpu0_int_0_31_status;
	volatile sys_cpu0_int_32_63_status_t cpu0_int_32_63_status;
	volatile sys_cpu0_int_64_95_status_t cpu0_int_64_95_status;
	volatile sys_cpu1_int_0_31_status_t cpu1_int_0_31_status;
	volatile sys_cpu1_int_32_63_status_t cpu1_int_32_63_status;
	volatile sys_cpu1_int_64_95_status_t cpu1_int_64_95_status;
	volatile sys_m55sub_int_0_31_status_t m55sub_int_0_31_status;
	volatile sys_m55sub_int_32_63_status_t m55sub_int_32_63_status;
	volatile sys_m55sub_int_64_95_status_t m55sub_int_64_95_status;
	volatile uint32_t rsv_29_29[1];
	volatile sys_reserver_reg0x2a_t reserver_reg0x2a;
	volatile sys_reserver_reg0x2b_t reserver_reg0x2b;
	volatile sys_reserver_reg0x2c_t reserver_reg0x2c;
	volatile uint32_t rsv_2d_2d[1];
	volatile sys_reserver_reg0x2e_t reserver_reg0x2e;
	volatile sys_reserver_reg0x2f_t reserver_reg0x2f;
	volatile sys_gpio_input_status0_t gpio_input_status0;
	volatile sys_gpio_input_status1_t gpio_input_status1;
	volatile sys_gpio_input_status2_t gpio_input_status2;
	volatile sys_reserver_reg0x33_t reserver_reg0x33;
	volatile sys_cpu0_curpc_t cpu0_curpc;
	volatile sys_cpu0_faultstat_H_t cpu0_faultstat_H;
	volatile sys_cpu0_faultstat_L_t cpu0_faultstat_L;
	volatile sys_cpu0_info_t cpu0_info;
	volatile sys_sys_debug_config0_t sys_debug_config0;
	volatile sys_sys_debug_config1_t sys_debug_config1;
	volatile sys_anareg_stat_t anareg_stat;
	volatile sys_reserver_reg0x3b_t reserver_reg0x3b;
	volatile sys_cpu1_curpc_t cpu1_curpc;
	volatile sys_cpu1_faultstat_H_t cpu1_faultstat_H;
	volatile sys_cpu1_faultstat_L_t cpu1_faultstat_L;
	volatile sys_cpu1_info_t cpu1_info;
	volatile sys_ana_reg0_t ana_reg0;
	volatile sys_ana_reg1_t ana_reg1;
	volatile sys_ana_reg2_t ana_reg2;
	volatile sys_ana_reg3_t ana_reg3;
	volatile sys_ana_reg4_t ana_reg4;
	volatile sys_ana_reg5_t ana_reg5;
	volatile sys_ana_reg6_t ana_reg6;
	volatile sys_ana_reg7_t ana_reg7;
	volatile sys_ana_reg8_t ana_reg8;
	volatile sys_ana_reg9_t ana_reg9;
	volatile sys_ana_reg10_t ana_reg10;
	volatile sys_ana_reg11_t ana_reg11;
	volatile sys_ana_reg12_t ana_reg12;
	volatile sys_ana_reg13_t ana_reg13;
	volatile sys_ana_reg14_t ana_reg14;
	volatile sys_ana_reg15_t ana_reg15;
	volatile sys_ana_reg16_t ana_reg16;
	volatile sys_ana_reg17_t ana_reg17;
	volatile sys_ana_reg18_t ana_reg18;
	volatile sys_ana_reg19_t ana_reg19;
	volatile sys_ana_reg20_t ana_reg20;
	volatile sys_ana_reg21_t ana_reg21;
	volatile sys_ana_reg22_t ana_reg22;
	volatile sys_ana_reg23_t ana_reg23;
	volatile sys_ana_reg24_t ana_reg24;
	volatile sys_ana_reg25_t ana_reg25;
	volatile sys_ana_reg26_t ana_reg26;
	volatile sys_ana_reg27_t ana_reg27;
	volatile sys_ana_reg28_t ana_reg28;
	volatile sys_ana_reg29_t ana_reg29;
	volatile sys_ana_reg30_t ana_reg30;
	volatile sys_ana_reg31_t ana_reg31;
	volatile sys_ana_reg32_t ana_reg32;
	volatile sys_ana_reg33_t ana_reg33;
	volatile sys_ana_reg34_t ana_reg34;
	volatile sys_ana_reg35_t ana_reg35;
	volatile sys_ana_reg36_t ana_reg36;
	volatile sys_ana_reg37_t ana_reg37;
	volatile sys_ana_reg38_t ana_reg38;
	volatile sys_ana_reg39_t ana_reg39;
	volatile sys_ana_reg40_t ana_reg40;
	volatile sys_ana_reg41_t ana_reg41;
	volatile sys_ana_reg42_t ana_reg42;
	volatile sys_ana_reg43_t ana_reg43;
	volatile sys_ana_reg44_t ana_reg44;
	volatile sys_ana_reg45_t ana_reg45;
	volatile sys_ana_reg46_t ana_reg46;
	volatile sys_ana_reg47_t ana_reg47;
} sys_hw_t;

#ifdef __cplusplus
}
#endif
